### 실습 준비

In [1]:
from pandas import DataFrame, read_csv, read_excel

## DataFrame 생성하기 - 1

In [2]:
# 2차원 리스트를 DataFrame으로 변환
# 특별한 옵션 지정 없으면, 인데스는 0부터 시작

grade_data = [
    [1,'남자',98,77,88,64],
    [2,'여자',88,90,62,72],
    [1,'남자',92,70,83,79],
    [3,'여자',63,60,31,70],
    [4,'남자',75,50,90,88]
]

# 2차원 리스트를 데이터프레임으로 변환
# -> 학생별 점수 표현
df = DataFrame(grade_data)
df

   0   1   2   3   4   5
0  1  남자  98  77  88  64
1  2  여자  88  90  62  72
2  1  남자  92  70  83  79
3  3  여자  63  60  31  70
4  4  남자  75  50  90  88

## DataFrame 생성하기 - 2

In [3]:
# 인덱스와 컬럼 이름 지정하기

# 인덱스 이름으로 사용할 리스트
i_names = ['철수', '영희','민철','수현','호영']

# 컬럼 이름으로 사용할 리스트
c_names = ['학년', '성별', '국어', '영어','수학','과학']

# 인덱스와 컬럼이름 지정하기
df = DataFrame(grade_data, index = i_names, columns = c_names)
df

    학년  성별  국어  영어  수학  과학
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

## DataFrame 생성하기 - 3

In [4]:
# 어느 학급의 성적표를 표현한 딕셔너리
grade_dic ={
    '학년': [1, 2, 1, 3, 4],
    '성별': ['남자', '여자', '남자', '여자', '남자'],
    '국어': [98, 88, 92, 63, 75],
    '영어': [77, 90, 70, 60, 50],
    '수학': [88, 62, 83, 31, 90],
    '과학': [64, 72, 79, 70, 88]
}

# 딕셔너리 key가 컬럼(열) 이름이 된다
df = DataFrame(grade_dic)
df

   학년  성별  국어  영어  수학  과학
0   1  남자  98  77  88  64
1   2  여자  88  90  62  72
2   1  남자  92  70  83  79
3   3  여자  63  60  31  70
4   4  남자  75  50  90  88

## DataFrame 생성하기 - 4

In [5]:
# 인덱스와 인덱스 이름을 지정한 DataFrame

# 인덱스 지정하기
df = DataFrame(grade_dic,
               index = ['철수','영희','민철','수현','호영'])

# 인덱스 제목 지정하기
df.index.name = '이름'
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

## DataFrame 생성하기 - 5

In [6]:
# 딕셔너리를 원소로 가지는 리스트를 활용한 DataFrame 생성

grade_list = [
    {'이름': '철수', '학년': 1, '성별': '남자', '국어': 98, '영어': 77, '수학':88, '과학': 64 },
    {'이름': '영희', '학년': 2, '성별': '여자', '국어': 88, '영어': 90, '수학':62, '과학': 72 },
    {'이름': '민철', '학년': 1, '성별': '남자', '국어': 92, '영어': 70, '수학':83, '과학': 79 },
    {'이름': '수현', '학년': 3, '성별': '여자', '국어': 63, '영어': 60, '수학':31, '과학': 70 },
    {'이름': '호영', '학년': 4, '성별': '남자', '국어': 75, '영어': 50, '수학':90, '과학': 88 }
]

df = DataFrame(grade_list)
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

## DataFrame 생성하기 - 6

In [8]:
# 이미 생성된 DataFrame의 특정 컬럼을 index로 지정하기
# 원본 변화 없고, 복사본이 리턴

df2 = df.set_index('이름')
df2

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

## DataFrame 생성하기 - 7

In [ ]:
# 원본 데이터 변경

df.set_index('이름', inplace=True)
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

## DataFrame 생성하기 - 8

In [10]:
# 인덱스 해제하기
# 복사본 리턴
# 인덱스 새로 생성

df3 = df.reset_index()
df3

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

## DataFrame 생성하기 - 9

In [11]:
# 인덱스 해제 + 인덱스 제거

df3.reset_index(drop=True)

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

### 외부 파일로부터 데이터 프레임 생성 - 1

In [12]:
# CSV파일 가져오기

df = read_csv("https://data.hossam.kr/data/grade.csv", encoding = 'euc-kr')
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

### 외부 파일로부터 데이터 프레임 생성 - 2

In [15]:
# 인덱스로 열 이름 지정

df = read_csv("https://data.hossam.kr/data/grade.csv", encoding = 'euc-kr', index_col ='이름')
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

### 외부 파일로부터 데이터 프레임 생성 - 3

In [17]:
# 엑셀

df = read_excel("https://data.hossam.kr/data/grade.xlsx", index_col ='이름')
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80